# Place all the behaviors and hooks related to the matching controller here.
# All this logic will automatically be available in application.js.
# You can use CoffeeScript in this file: http://coffeescript.org/

$("#greet1").text("#1. 서막 재윤은 독서실에서 자다가 일어났다. 지금은 새벽 2시. 다른 학생들은 모두 집에 갔다. 재윤이 다니는 독서실은 3,4층에 위치했다. 카운터는 3층, 독서실은 4층에 있었다. 피곤한 재윤은_____").hide();
$("#greet1").text("#1. 서막 재윤은 독서실에서 자다가 일어났다. 지금은 새벽 2시. 다른 학생들은 모두 집에 갔다. 재윤이 다니는 독서실은 3,4층에 위치했다. 카운터는 3층, 독서실은 4층에 있었다. 피곤한 재윤은_____").fadeIn(5000);
$("#greet1").text("#1. 서막 재윤은 독서실에서 자다가 일어났다. 지금은 새벽 2시. 다른 학생들은 모두 집에 갔다. 재윤이 다니는 독서실은 3,4층에 위치했다. 카운터는 3층, 독서실은 4층에 있었다. 피곤한 재윤은_____").fadeOut(8000);

$("#greet2").text("경비 아저씨는 문을 닫아야 한다고 말한다. 그러나 다음 주 시험을 위해 좀더 공부해야 한다. 재윤은 아저씨한테 부탁한다. 아저씨는 한 숨을 쉬더니, 그러면 자신은 먼저 가볼테니 문단속 잘하라고 당부한다. 아저씨가 떠난 후, 재윤은 독서실에 혼자 앉아서 열심히 공부한다. 그때 전화가 울린다. 재윤은 처음에는 무시한다. 그러나 전화는 계속해서 울린다. 소리가 시끄러웠던 재윤은____").hide();
$("#greet2").text("경비 아저씨는 문을 닫아야 한다고 말한다. 그러나 다음 주 시험을 위해 좀더 공부해야 한다. 재윤은 아저씨한테 부탁한다. 아저씨는 한 숨을 쉬더니, 그러면 자신은 먼저 가볼테니 문단속 잘하라고 당부한다. 아저씨가 떠난 후, 재윤은 독서실에 혼자 앉아서 열심히 공부한다. 그때 전화가 울린다. 재윤은 처음에는 무시한다. 그러나 전화는 계속해서 울린다. 소리가 시끄러웠던 재윤은____").fadeIn(5000);
$("#greet2").text("경비 아저씨는 문을 닫아야 한다고 말한다. 그러나 다음 주 시험을 위해 좀더 공부해야 한다. 재윤은 아저씨한테 부탁한다. 아저씨는 한 숨을 쉬더니, 그러면 자신은 먼저 가볼테니 문단속 잘하라고 당부한다. 아저씨가 떠난 후, 재윤은 독서실에 혼자 앉아서 열심히 공부한다. 그때 전화가 울린다. 재윤은 처음에는 무시한다. 그러나 전화는 계속해서 울린다. 소리가 시끄러웠던 재윤은____").fadeOut(8000);

$("#greet3").text("집에 가는 길, 재윤은 공부 내용을 정리한 노트를 두고왔다는 것을 깨닫는다. 왔던 길을 돌아간다. 독서실 앞, 재윤은 독서실 문을 닫고 퇴근하려는 경비 아저씨와 마주한다. 안으로 들어가려고 하지만, 경비 아저씨가 극구 말린다. 이유를 물어보지만 대답하지 않는다. 재윤은 무서워진다.").hide();
$("#greet3").text("집에 가는 길, 재윤은 공부 내용을 정리한 노트를 두고왔다는 것을 깨닫는다. 왔던 길을 돌아간다. 독서실 앞, 재윤은 독서실 문을 닫고 퇴근하려는 경비 아저씨와 마주한다. 안으로 들어가려고 하지만, 경비 아저씨가 극구 말린다. 이유를 물어보지만 대답하지 않는다. 재윤은 무서워진다.").fadeIn(5000);
$("#greet3").text("집에 가는 길, 재윤은 공부 내용을 정리한 노트를 두고왔다는 것을 깨닫는다. 왔던 길을 돌아간다. 독서실 앞, 재윤은 독서실 문을 닫고 퇴근하려는 경비 아저씨와 마주한다. 안으로 들어가려고 하지만, 경비 아저씨가 극구 말린다. 이유를 물어보지만 대답하지 않는다. 재윤은 무서워진다.").fadeOut(8000);

$("#greet4").text("집아저씨는 다급한 목소리로 누가 문을 열어주라고 해도 열어주면 안된다고 말한다. 재윤은 무서워진다. 그래서 방의 짐을 싸고 집으로 가려고 하는 순간, 또각또각 구두소리가 난다. 그리고 섬뜩할 만큼 가는, ‘문 좀 열어주세요’라는 소리가 들린다. 그래서 재윤은____").hide();
$("#greet4").text("집아저씨는 다급한 목소리로 누가 문을 열어주라고 해도 열어주면 안된다고 말한다. 재윤은 무서워진다. 그래서 방의 짐을 싸고 집으로 가려고 하는 순간, 또각또각 구두소리가 난다. 그리고 섬뜩할 만큼 가는, ‘문 좀 열어주세요’라는 소리가 들린다. 그래서 재윤은____").fadeIn(5000);
$("#greet4").text("집아저씨는 다급한 목소리로 누가 문을 열어주라고 해도 열어주면 안된다고 말한다. 재윤은 무서워진다. 그래서 방의 짐을 싸고 집으로 가려고 하는 순간, 또각또각 구두소리가 난다. 그리고 섬뜩할 만큼 가는, ‘문 좀 열어주세요’라는 소리가 들린다. 그래서 재윤은____").fadeOut(8000);

$("#greet5").text("더 이상 전화가 울리지 않는 것 같다. 그때 갑자기 문을 두드리는 소리가 들린다. 소리가 점점 커진다. 무서워진 재윤은 독서실 문쪽으로 간다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____").hide();
$("#greet5").text("더 이상 전화가 울리지 않는 것 같다. 그때 갑자기 문을 두드리는 소리가 들린다. 소리가 점점 커진다. 무서워진 재윤은 독서실 문쪽으로 간다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____").fadeIn(5000);
$("#greet5").text("더 이상 전화가 울리지 않는 것 같다. 그때 갑자기 문을 두드리는 소리가 들린다. 소리가 점점 커진다. 무서워진 재윤은 독서실 문쪽으로 간다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____").fadeOut(8000);

$("#greet6").text("재윤은 천천히 독서실로 올라간다. 그런데 갑자기 뒤에서 또각또각 구두소리가 난다. 이상한 낌새를 눈치 챈 재윤은 걸음을 멈춘다. 그때 또각또각 소리도 멈춘다. 재윤은 다시 걷기 시작한다. 다시 구두소리가 난다. 무서워진 재윤은 뛰기 시작한다. 또각또각 소리도 빨라진다. 재윤은 독서실 문을 열고 바로 문을 닫는다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____
").hide();
$("#greet6").text("재윤은 천천히 독서실로 올라간다. 그런데 갑자기 뒤에서 또각또각 구두소리가 난다. 이상한 낌새를 눈치 챈 재윤은 걸음을 멈춘다. 그때 또각또각 소리도 멈춘다. 재윤은 다시 걷기 시작한다. 다시 구두소리가 난다. 무서워진 재윤은 뛰기 시작한다. 또각또각 소리도 빨라진다. 재윤은 독서실 문을 열고 바로 문을 닫는다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____
").fadeIn(5000);
$("#greet6").text("재윤은 천천히 독서실로 올라간다. 그런데 갑자기 뒤에서 또각또각 구두소리가 난다. 이상한 낌새를 눈치 챈 재윤은 걸음을 멈춘다. 그때 또각또각 소리도 멈춘다. 재윤은 다시 걷기 시작한다. 다시 구두소리가 난다. 무서워진 재윤은 뛰기 시작한다. 또각또각 소리도 빨라진다. 재윤은 독서실 문을 열고 바로 문을 닫는다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____
").fadeOut(8000);

$("#greet7").text("그러나 아저씨는 미안하다며 함께 할 수 없다고 한다. 대신 재윤에게 열쇠를 넘겨준다. 어쩔 수 없이 재윤은 혼자 독서실로 올라간다. 그런데 갑자기 뒤에서 또각또각 구두소리가 난다. 이상한 낌새를 눈치 챈 재윤은 걸음을 멈춘다. 그때 또각또각 소리도 멈춘다. 재윤은 다시 걷기 시작한다. 다시 구두소리가 난다. 무서워진 재윤은 뛰기 시작한다. 또각또각 소리도 빨라진다. 재윤은 독서실 문을 열고 바로 문을 닫는다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____").hide();
$("#greet7").text("그러나 아저씨는 미안하다며 함께 할 수 없다고 한다. 대신 재윤에게 열쇠를 넘겨준다. 어쩔 수 없이 재윤은 혼자 독서실로 올라간다. 그런데 갑자기 뒤에서 또각또각 구두소리가 난다. 이상한 낌새를 눈치 챈 재윤은 걸음을 멈춘다. 그때 또각또각 소리도 멈춘다. 재윤은 다시 걷기 시작한다. 다시 구두소리가 난다. 무서워진 재윤은 뛰기 시작한다. 또각또각 소리도 빨라진다. 재윤은 독서실 문을 열고 바로 문을 닫는다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____").fadeIn(5000);
$("#greet7").text("그러나 아저씨는 미안하다며 함께 할 수 없다고 한다. 대신 재윤에게 열쇠를 넘겨준다. 어쩔 수 없이 재윤은 혼자 독서실로 올라간다. 그런데 갑자기 뒤에서 또각또각 구두소리가 난다. 이상한 낌새를 눈치 챈 재윤은 걸음을 멈춘다. 그때 또각또각 소리도 멈춘다. 재윤은 다시 걷기 시작한다. 다시 구두소리가 난다. 무서워진 재윤은 뛰기 시작한다. 또각또각 소리도 빨라진다. 재윤은 독서실 문을 열고 바로 문을 닫는다. 그때 전화가 울린다. 얼떨결에 재윤은 전화를 받는다. 경비 아저씨다. 아저씨는 무슨 일이 있어도 문을 열어주면 안된다고 말하고 전화를 끊는다. 그때, 문 밖에서 섬뜩할 만큼 가는 목소리로 ‘문 좀 열어주세요’라고 누군가 말한다. 그래서 재윤은____").fadeOut(8000);

$("#greet8").text("문 밖에서 화사한 차림의 예쁜 여자가 서 있다. 몽환적인 분위기를 풍기는 그녀는 입가에 미소를 짓고 있다. 그녀는 재윤에게 손가락을 ‘까딱까딱’하며 가까이 오라고 손짓한다. 그래서 재윤은____").hide();
$("#greet8").text("문 밖에서 화사한 차림의 예쁜 여자가 서 있다. 몽환적인 분위기를 풍기는 그녀는 입가에 미소를 짓고 있다. 그녀는 재윤에게 손가락을 ‘까딱까딱’하며 가까이 오라고 손짓한다. 그래서 재윤은____").fadeIn(5000);
$("#greet8").text("문 밖에서 화사한 차림의 예쁜 여자가 서 있다. 몽환적인 분위기를 풍기는 그녀는 입가에 미소를 짓고 있다. 그녀는 재윤에게 손가락을 ‘까딱까딱’하며 가까이 오라고 손짓한다. 그래서 재윤은____").fadeOut(8000);

$("#greet9").text("똑똑 거리는 소리가 사라진다. 정적이 흐른다. 재윤은 무서움을 느낀다. 그래서 어떻게든 이 상황을 벗어나고 싶다. 그래서 재윤은___
").hide();
$("#greet9").text("똑똑 거리는 소리가 사라진다. 정적이 흐른다. 재윤은 무서움을 느낀다. 그래서 어떻게든 이 상황을 벗어나고 싶다. 그래서 재윤은___
").fadeIn(5000);
$("#greet9").text("똑똑 거리는 소리가 사라진다. 정적이 흐른다. 재윤은 무서움을 느낀다. 그래서 어떻게든 이 상황을 벗어나고 싶다. 그래서 재윤은___
").fadeOut(8000);

$("#greet10").text("독서실 안 쪽 방. 재윤은 너무 무서워서 한쪽 구석에 웅크리고 앉아 있다. 무서움과 피곤함 때문에 재윤은 잠시 동안 잠 든다. 그러다가 재윤은 온 몸이 시려워서 눈을 뜬다. 앞을 보니 창문이 열러 있다. 그때 창문 쪽에서 ’똑똑, 똑똑’ 하는 소리가 들린다. 자세히 보니 창문 밖에서 손가락 2개가 창문 난간을 두드리고 있다. 너무 놀란 재윤은 ‘헙!’하는 소리를 낸다. 그러자 창문 밖 손가락 2개가 재윤을 향해 가까이 오라며 ‘까딱까딱’ 손짓 한다. 그래서 재윤은____").hide();
$("#greet10").text("독서실 안 쪽 방. 재윤은 너무 무서워서 한쪽 구석에 웅크리고 앉아 있다. 무서움과 피곤함 때문에 재윤은 잠시 동안 잠 든다. 그러다가 재윤은 온 몸이 시려워서 눈을 뜬다. 앞을 보니 창문이 열러 있다. 그때 창문 쪽에서 ’똑똑, 똑똑’ 하는 소리가 들린다. 자세히 보니 창문 밖에서 손가락 2개가 창문 난간을 두드리고 있다. 너무 놀란 재윤은 ‘헙!’하는 소리를 낸다. 그러자 창문 밖 손가락 2개가 재윤을 향해 가까이 오라며 ‘까딱까딱’ 손짓 한다. 그래서 재윤은____").fadeIn(5000);
$("#greet10").text("독서실 안 쪽 방. 재윤은 너무 무서워서 한쪽 구석에 웅크리고 앉아 있다. 무서움과 피곤함 때문에 재윤은 잠시 동안 잠 든다. 그러다가 재윤은 온 몸이 시려워서 눈을 뜬다. 앞을 보니 창문이 열러 있다. 그때 창문 쪽에서 ’똑똑, 똑똑’ 하는 소리가 들린다. 자세히 보니 창문 밖에서 손가락 2개가 창문 난간을 두드리고 있다. 너무 놀란 재윤은 ‘헙!’하는 소리를 낸다. 그러자 창문 밖 손가락 2개가 재윤을 향해 가까이 오라며 ‘까딱까딱’ 손짓 한다. 그래서 재윤은____").fadeOut(8000);